// /* 自定义
//
//     添加话术自定义
//
//     自定义搜索间隔
//
//     搜索多少次以后等待多久
//
//     本地识别顺序
//

//
//     备注抖音号
//
//     {"code":0,"data":{"method":"","nickname":"济南槐荫羊庄餐厅","gender":"","displayId":"dyd5b2a34rql","uid":null,"secUid":null,"phone":"15064069899","info":null}}
//
//     {"使用说明":"在微信聊天列表启动","搜索间隔低":"1","搜索间隔高":"1","打招呼话术":"你好,抖音主页看到你联系方式的","添加个数":"0"}
//
//     desc('微信')
//     desc('双开微信')
//
// */
//
// let 休息个数 = 4
// let 休息间隔低 = 5   //分钟
// let 休息间隔高 = 8   // 分钟
// let 搜索间隔低 = 1   //秒
// let 搜索间隔高 = 1   //秒
// let 打招呼话术 = '你好,抖音主页看到你联系方式的'
// let 备注内容 = ''
// let 添加个数 = 0
// let 添加上限 = 3
// let 手机号 = '15397893254' //15397893254
// let 切换微信标记 = 0
//
// 引用模块()
//
// while (true) {
//     切换微信()
// }
//
// 停止运行()
//
// // main()
//
// function 切换微信() {
//
//     切换微信标记++
//
//     let 超时秒数 = 20
//     let 起始时间 = 模块.获取时间().秒
//
//     while (true) {
//
//         home()
//         sleep(2000);
//
//         let re = 模块.微信.获取桌面微信数组()
//         if (re) {
//             if (切换微信标记 % 2 === 0) {  //整除2就点开第二个
//                 clickPoint((re[1].bounds.left + re[1].bounds.right) / 2, (re[1].bounds.top + re[1].bounds.bottom) / 2)
//                 sleep(3000);
//                 return true
//             }
//             clickPoint((re[0].bounds.left + re[0].bounds.right) / 2, (re[0].bounds.top + re[0].bounds.bottom) / 2)
//             sleep(3000);
//             return true
//         }
//
//         if ((模块.获取时间().秒 - 起始时间) > 超时秒数) {
//             // 模块.气泡弹窗('操作粉丝列表用户,' + '任务超时')
//             return null
//         }
//     }
//
// }
//
// function main() {
//
//     while (true) {
//         模块.微信.返回加号界面()
//         模块.微信.点击加号()
//         模块.微信.点击添加朋友()
//         if (模块.微信.点击帐号手机号()) {
//             输入(手机号, 模块.微信.控件.帐号手机号[模块.微信.微信版本号()])
//         }
//         if (模块.微信.点击搜索()) {
//             sleep(1000);
//             if (!模块.微信.点击添加到通讯录()) {
//                 模块.微信.返回加号界面()
//                 continue
//             }
//             if (模块.微信.点击验证信息输入框()) {
//                 logd(模块.微信.控件.验证信息输入框[模块.微信.微信版本号()]);
//                 输入(打招呼话术, 模块.微信.控件.验证信息输入框[模块.微信.微信版本号()])
//             }
//             if (模块.微信.点击备注输入框()) {
//                 输入(备注内容, 模块.微信.控件.验证信息输入框[模块.微信.微信版本号()])
//                 back()
//                 sleep(1500);
//             }
//             if (模块.微信.点击发送()) {
//                 添加个数++
//                 if (添加个数 >= 添加上限) {
//                     对话框消息('警告!!!', '已添加:' + 添加个数 + ',个停止运行');
//                     停止运行()
//                 }
//                 if (添加个数 >= 休息个数) {
//                     toast('已添加:' + 添加个数 + ',开始休息');
//                     let 休息时间 = random(休息间隔低, 休息间隔高)
//                     休息时间 = 休息时间 * 60
//                     for (let i = 休息时间; i >= 0; i--) {
//                         logd('等待' + i + '秒');
//                         sleep(1000);
//                     }
//                 }
//                 toast('已添加:' + 添加个数 + '个');
//                 let 等待时间 = random(搜索间隔低, 搜索间隔高)
//                 toast('等待' + 等待时间 + '秒');
//                 sleep(等待时间 * 1000);
//             }
//         }
//         sleep(200);
//         停止运行()
//     }
//
// }
//
// function 停止运行() {
//     thread.stopAll();//取消所有正在运行的线程
//     exit();//退出脚本
//     ui.stopTask();//停止脚本
// }
//
// function 引用模块() {
//     模块 = require("mk/mk.js")
// }
//
// function 对话框消息(a, b) {
//     logd('对话框消息:' + a);
//     logd('对话框消息:' + b);
//     laoleng.Alert.dialog(a, b)
// }
//
// function 输入(a, b) {
//     if (!a) {
//         logd('读取a的值无法识别');
//         return
//     }
//     let str = a.toString()
//     logd('输入:' + str)
//     模块.强制刷新节点()
//     inputText(b, str)
//     sleep(2000);
// }